betaflight/betaflight/src/main/rx/cc2500_frsky.c
/*
 * This file is part of Cleanflight.
 *
 * Cleanflight is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * Cleanflight is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with Cleanflight.  If not, see <http://www.gnu.org/licenses/>.
 */

// This file is copied with modifications from OpenSky,
// see https://github.com/fishpepper/OpenSky

// See also in particular
// https://github.com/fishpepper/OpenSky/blob/master/frsky.c

#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include "platform.h"

#ifdef USE_RX_FRSKY

#include "build/build_config.h"
#include "build/debug.h"

#include "common/maths.h"
#include "common/utils.h"

#include "drivers/rx_cc2500.h"
#include "drivers/system.h"

#include "rx/rx.h"
#include "rx/rx_spi.h"
#include "rx/cc2500_frsky.h"

#define DEFAULT_FSCAL_VALUE (-69)

#define FRSKY_CHANNEL_COUNT 8
#define FRSKY_HOPTABLE_SIZE 47

#define FRSKY_COUNT_RXSTATS 50
#define FRSKY_PACKET_LENGTH 17
#define FRSKY_PACKET_BUFFER_SIZE (FRSKY_PACKET_LENGTH+3)

//packet data example:
//BIND:   [11 03 01 16 68 14 7E BF 15 56 97 00 00 00 00 00 00 0B F8 AF ]
//NORMAL: [11 16 68 ... ]
//TX:                 11 16 68 7A 1B 0B CA CB CF C4 88 85 CB CB CB 92 8B 78 21 AF
//TELEMETRY WITH HUB: 11 16 68 60 64 5B 00 00 5E 3B 09 00 5E 5E 3B 09 00 5E 48 B1
#define FRSKY_VALID_FRAMELENGTH(_b) (_b[0] == 0x11)
#define FRSKY_VALID_CRC(_b)     (_b[19] & 0x80)
#define FRSKY_VALID_TXID(_b) ((_b[1] == storage.frsky_txid[0]) && (_b[2] == storage.frsky_txid[1]))
#define FRSKY_VALID_PACKET_BIND(_b) (FRSKY_VALID_FRAMELENGTH(_b) && FRSKY_VALID_CRC(_b) && (_b[2] == 0x01))
#define FRSKY_VALID_PACKET(_b)      (FRSKY_VALID_FRAMELENGTH(_b) && FRSKY_VALID_CRC(_b) && FRSKY_VALID_TXID(_b) )


#define debug(x) {}
#define debug_flush() {}
#define debug_put_hex8(x) {}
#define debug_put_int8(x) {}
#define debug_put_uint8(x) {}
#define debug_putc(x) {}
#define debug_put_newline() {}

void frsky_do_bind(void);
void frsky_configure_address(void);
void frsky_autotune(void);
void frsky_fetch_txid_and_hoptable(void);
void frsky_tune_channel(uint8_t ch);
void frsky_show_partinfo(void);
void frsky_enter_rxmode(uint8_t channel);
void frsky_handle_overflows(void);


typedef enum {
    STATE_BIND = 0,
    STATE_DATA
} protocol_state_t;

static protocol_state_t protocolState;

static const uint8_t storage_default_hoptable[FRSKY_HOPTABLE_SIZE] = {
    0x01, 0x42, 0x83, 0xC4, 0x1A, 0x5B, 0x9C, 0xDD, 0x33, 0x74, 0xB5, 0x0B,
    0x4C, 0x8D, 0xCE, 0x24, 0x65, 0xA6, 0xE7, 0x3D, 0x7E, 0xBF, 0x15, 0x56,
    0x97, 0xD8, 0x2E, 0x6F, 0xB0, 0x06, 0x47, 0x88, 0xC9, 0x1F, 0x60, 0xA1,
    0xE2, 0x38, 0x79, 0xBA, 0x10, 0x51, 0x92, 0xD3, 0x29, 0x6A, 0xAB
};

static uint32_t timeOfLastHopUs;
static const uint32_t hopTimeoutUs = 5000; // 5ms

#define STORAGE_VERSION_ID 0x01
typedef struct storage_s {
    //version id
    uint8_t version;
    //persistent storage for frsky
    uint8_t frsky_txid[2];
    uint8_t frsky_hop_table[FRSKY_HOPTABLE_SIZE];
    int8_t  frsky_freq_offset;
    //add further data here...
} storage_t;

static storage_t storage;

static uint8_t frsky_current_ch_idx;

//diversity counter
static uint8_t frsky_diversity_count;

//rssi
static uint8_t frsky_rssi;
static uint8_t frsky_link_quality;

//pll calibration
static uint8_t frsky_calib_fscal1_table[FRSKY_HOPTABLE_SIZE];
static uint8_t frsky_calib_fscal2;
static uint8_t frsky_calib_fscal3;
//static int16_t storage.frsky_freq_offset_acc;

//rf rxtx buffer
static volatile uint8_t frsky_packet_buffer[FRSKY_PACKET_BUFFER_SIZE];
static volatile uint8_t frsky_packet_received;
static volatile uint8_t frsky_packet_sent;

static void storageInit(void)
{
    storage.version = STORAGE_VERSION_ID;

    //hard coded config for debugging:
    storage.frsky_txid[0] = 0x16;
    storage.frsky_txid[1] = 0x68;
    storage.frsky_freq_offset = DEFAULT_FSCAL_VALUE;

    for (int i = 0; i < FRSKY_HOPTABLE_SIZE; i++) {
        storage.frsky_hop_table[i] = storage_default_hoptable[i];
    }
}

static bool frskyCheckBindPacket(const uint8_t *payload)
{
#define BIND_PAYLOAD0       0x11
#define BIND_PAYLOAD2       0x01
    bool bindPacket = false;
    if (FRSKY_VALID_PACKET_BIND(payload)) {
        bindPacket = true;
        //!!TODO process bind packet to set txid and hopping channels
    }
    return bindPacket;
}

void frskySetRcDataFromPayload(uint16_t *rcData, const uint8_t *payload)
{
    // see frsky_update_ppm() in https://github.com/fishpepper/OpenSky/blob/master/frsky.c
    rcData[0] = (uint16_t)(((payload[10] & 0x0F)<<8 | payload[6]));
    rcData[1] = (uint16_t)(((payload[10] & 0xF0)<<4 | payload[7]));
    rcData[2] = (uint16_t)(((payload[11] & 0x0F)<<8 | payload[8]));
    rcData[3] = (uint16_t)(((payload[11] & 0xF0)<<4 | payload[9]));
    rcData[4] = (uint16_t)(((payload[16] & 0x0F)<<8 | payload[12]));
    rcData[5] = (uint16_t)(((payload[16] & 0xF0)<<4 | payload[13]));
    rcData[6] = (uint16_t)(((payload[17] & 0x0F)<<8 | payload[14]));
    rcData[7] = (uint16_t)(((payload[17] & 0xF0)<<4 | payload[15]));
}

static void frskyHopToNextChannel(void)
{
}

static void frskySetHoppingChannels(void)
{

}

static void frskySetBound(void)
{
    protocolState = STATE_DATA;

    timeOfLastHopUs = micros();
    frskySetHoppingChannels();
}

/*
 * This is called periodically by the scheduler.
 * Returns RX_SPI_RECEIVED_DATA if a data packet was received.
 */
rx_spi_received_e frskyDataReceived(uint8_t *payload)
{
    rx_spi_received_e ret = RX_SPI_RECEIVED_NONE;
    uint32_t timeNowUs;
    uint8_t packetReceived;
    switch (protocolState) {
    case STATE_BIND:
        cc25xx_process_packet(&packetReceived, payload, FRSKY_PACKET_BUFFER_SIZE);
        if (packetReceived) {
            const bool bindPacket = frskyCheckBindPacket(payload);
            if (bindPacket) {
                ret = RX_SPI_RECEIVED_BIND;
                //writeBindAckPayload(payload);
                // got a bind packet, so set the hopping channels and the rxTxAddr and start listening for data
                frskySetBound();
            }
        }
        break;
    case STATE_DATA:
        timeNowUs = micros();
        // read the payload, processing of payload is deferred
        cc25xx_process_packet(&packetReceived, payload, FRSKY_PACKET_BUFFER_SIZE);
        if (packetReceived) {
            const bool bindPacket = frskyCheckBindPacket(payload);
            if (bindPacket) {
                // transmitter may still continue to transmit bind packets after we have switched to data mode
                ret = RX_SPI_RECEIVED_BIND;
                //writeBindAckPayload(payload);
            } else {
                ret = RX_SPI_RECEIVED_DATA;
                //writeTelemetryAckPayload();
            }
        }
        if ((ret == RX_SPI_RECEIVED_DATA) || (timeNowUs > timeOfLastHopUs + hopTimeoutUs)) {
            frskyHopToNextChannel();
            timeOfLastHopUs = timeNowUs;
        }
        break;
    }
    return ret;
}

void frsky_show_partinfo(void)
{
    uint8_t partnum, version;
    //start idle
    cc25xx_strobe(RFST_SIDLE);

    //check version:
    debug("frsky: cc25xx partnum 0x");
    partnum = cc25xx_get_register_burst(PARTNUM);
    debug_put_hex8(partnum);

    debug(" version 0x");
    version = cc25xx_get_register_burst(VERSION);
    debug_put_hex8(version);
    debug_put_newline();

    if (cc25xx_partnum_valid(partnum, version)){
        debug("frsky: got valid part and version info\n");
    }else{
        debug("frsky: got INVALID part and version info?!\n");
    }
    debug_flush();
}


