betaflight/betaflight/src/main/rx/cc2500_frsky.c
static void frsky_configure(void)
{
    debug("frsky: configure\n"); debug_flush();

    //start idle
    cc25xx_strobe(RFST_SIDLE);
    
    // IOCFG0,1,2 is set in hal code (it is specific to the board used)
    cc25xx_set_gdo_mode();

    //normal config
    cc25xx_set_register(MCSM1    ,0x0F); //go back to rx after transmission completed //0x0C = stay idle;
    cc25xx_set_register(MCSM0    ,0x18);
    cc25xx_set_register(PKTLEN   ,FRSKY_PACKET_LENGTH); //on 251x this has to be exactly our size
    cc25xx_set_register(PKTCTRL0 ,0x05);
    cc25xx_set_register(PA_TABLE0,0xFF);
    cc25xx_set_register(FSCTRL1  ,0x08); //D4R-II seems to set 0x68 here ?! instead of 0x08
    cc25xx_set_register(FSCTRL0  ,0x00);
    //set base freq 2404 mhz
    cc25xx_set_register(FREQ2    ,0x5C);
    cc25xx_set_register(FREQ1    ,0x76);
    cc25xx_set_register(FREQ0    ,0x27);
    cc25xx_set_register(MDMCFG4  ,0xAA);
    cc25xx_set_register(MDMCFG3  ,0x39);
    cc25xx_set_register(MDMCFG2  ,0x11);
    cc25xx_set_register(MDMCFG1  ,0x23);
    cc25xx_set_register(MDMCFG0  ,0x7A);
    cc25xx_set_register(DEVIATN  ,0x42);
    cc25xx_set_register(FOCCFG   ,0x16);
    cc25xx_set_register(BSCFG    ,0x6C);
    cc25xx_set_register(AGCCTRL2 ,0x03);
    cc25xx_set_register(AGCCTRL1 ,0x40); //D4R uses 46 instead of 0x40);
    cc25xx_set_register(AGCCTRL0 ,0x91);
    cc25xx_set_register(FREND1   ,0x56);
    cc25xx_set_register(FREND0   ,0x10);
    cc25xx_set_register(FSCAL3   ,0xA9);
    cc25xx_set_register(FSCAL2   ,0x05);
    cc25xx_set_register(FSCAL1   ,0x00);
    cc25xx_set_register(FSCAL0   ,0x11);
    //???FSTEST   , 0x59);
    cc25xx_set_register(TEST2    ,0x88);
    cc25xx_set_register(TEST1    ,0x31);
    cc25xx_set_register(TEST0    ,0x0B);
    //???FIFOTHR  = 0x07);
    cc25xx_set_register(ADDR     ,0x00);

    //for now just append status
    cc25xx_set_register(PKTCTRL1, CC2500_PKTCTRL1_APPEND_STATUS);
    debug("frsky: configure done\n"); debug_flush();
}


void wdt_reset(void)
{
    IWDG_ReloadCounter();
}

static uint32_t timeoutMs;
void timeout_set(uint32_t ms)
{
    timeoutMs = millis() + ms;
}

bool timeout_timed_out(void)
{
    return cmp32(millis(), timeoutMs) > 0 ? true : false;
}


uint8_t frsky_bind_jumper_set(void)
{
#if 0
    debug("frsky: BIND jumper set = "); debug_flush();
    if (io_bind_request()){
        debug("YES -> binding\n");
        return 1;
    }else{
        debug("NO -> no binding\n");
        return 0;
    }
#endif
    return 0;
}

void led_red_off(void) {}
void led_red_on(void) {}
void led_green_off(void) {}
void led_green_on(void) {}

void frsky_do_bind(void)
{
    debug("frsky: do bind\n"); debug_flush();

    //set txid to bind channel
    storage.frsky_txid[0] = 0x03;

    //frequency offset to zero (will do auto tune later on)
    storage.frsky_freq_offset = 0;

    //init txid matching
    frsky_configure_address();

    //set up leds:frsky_txid
    led_red_off();
    led_green_on();

    //start autotune:
    frsky_autotune();

    //now run the actual binding:
    frsky_fetch_txid_and_hoptable();

    //important: stop RF interrupts:
    cc25xx_disable_rf_interrupt();

    //save to persistant storage:
    //storage_write_to_flash();

    //done, end up in fancy blink code
    debug("frsky: finished binding. please reset\n");
    //led_green_on();

    while(1){
        led_red_on();
        delay(500);
        wdt_reset();

        led_red_off();
        delay(500);
        wdt_reset();
    }
}


void frsky_autotune(void){
    uint8_t done = 0;
    uint8_t received_packet = 0;
    uint8_t state = 0;
    int8_t fscal0_min=127;
    int8_t fscal0_max=-127;
    int16_t fscal0_calc;

    debug("frsky: autotune\n"); debug_flush();

    //enter RX mode
    frsky_enter_rxmode(0);

    //find best offset:
    storage.frsky_freq_offset = 0;

    debug("frsky: entering bind loop\n"); debug_flush();

    led_red_off();

    //search for best fscal 0 match
    while(state != 5){
        //reset wdt
        wdt_reset();

        //handle any ovf conditions
        frsky_handle_overflows();

        //search full range quickly using binary search
        switch(state){
        default:
        case(0):
            //init left search:
            storage.frsky_freq_offset = -127;
            state = 1;
            break;

        case(1):
            //first search quickly through the full range:
            if (storage.frsky_freq_offset < 127-10){
                storage.frsky_freq_offset += 9;
            }else{
                //done one search, did we receive anything?
                if (received_packet){
                    //finished, go to slow search
                    storage.frsky_freq_offset = fscal0_min - 9;
                    state = 2;
                }else{
                    //no success, lets try again
                    state = 0;
                }
            }
            break;

        case(2):
            if (storage.frsky_freq_offset < fscal0_max+9){
                storage.frsky_freq_offset++;
            }else{
                //done!
                state = 5;
            }
            break;
        }

        //go to idle
        cc25xx_strobe(RFST_SIDLE);

        //set freq offset
        cc25xx_set_register(FSCTRL0, storage.frsky_freq_offset);

        led_red_off();

        //go back to RX:
        delay(1);
        cc25xx_strobe(RFST_SRX);

        //set timeout
        timeout_set(50);
        done = 0;

        led_green_on();
        led_red_off();

        //debug("tune "); debug_put_int8(storage.frsky_freq_offset); debug_put_newline(); debug_flush();

        while((!timeout_timed_out()) && (!done)){
            //handle any ovf conditions
            frsky_handle_overflows();

            cc25xx_process_packet(&frsky_packet_received, (volatile uint8_t *)&frsky_packet_buffer, FRSKY_PACKET_BUFFER_SIZE);

            if (frsky_packet_received){
                //prepare for next packet:
                frsky_packet_received = 0;
                cc25xx_enable_receive();
                cc25xx_strobe(RFST_SRX);

