betaflight/betaflight/src/main/rx/cc2500_frsky.c
                //valid packet?
                if (FRSKY_VALID_PACKET_BIND(frsky_packet_buffer)){
                    //bind packet!
                    debug_putc('B');

                    //packet received
                    received_packet = 1;

                    //this fscal value is done
                    done = 1;

                    //update min/max
                    fscal0_min = MIN(fscal0_min, storage.frsky_freq_offset);
                    fscal0_max = MAX(fscal0_max, storage.frsky_freq_offset);

                    //make sure we never read the same packet twice by invalidating packet
                    frsky_packet_buffer[0] = 0x00;
                }

                /*debug("[");debug_flush();
        uint8_t cnt;
                for(cnt=0; cnt<FRSKY_PACKET_BUFFER_SIZE; cnt++){
                    debug_put_hex8(frsky_packet_buffer[cnt]);
                    debug_putc(' ');
                    debug_flush();
                }
                debug("]\n"); debug_flush();*/

            }
        }
        if (!done){
            debug_putc('-');
        }
    }

    //set offset to what we found out to be the best:
    fscal0_calc = (fscal0_max + fscal0_min)/2;

    debug("\nfrsky: fscal0 ");
    debug_put_int8(fscal0_min);
    debug(" - ");
    debug_put_int8(fscal0_max);
    debug_put_newline();
    debug_flush();

    //store new value
    storage.frsky_freq_offset = fscal0_calc;

    cc25xx_strobe(RFST_SIDLE);

    //set freq offset
    cc25xx_set_register(FSCTRL0, storage.frsky_freq_offset);

    //go back to RX:
    delay(1);
    cc25xx_strobe(RFST_SRX);

    debug("frsky: autotune done. offset=");
    debug_put_int8(storage.frsky_freq_offset);
    debug_put_newline();
    debug_flush();
}

void frsky_enter_rxmode(uint8_t channel)
{
    cc25xx_strobe(RFST_SIDLE);

    cc25xx_enter_rxmode();

    //set & do a manual tuning for the given channel
    frsky_tune_channel(channel);

    cc25xx_enable_receive();

    //go back to rx mode
    cc25xx_strobe(RFST_SRX);
}

void frsky_configure_address(void)
{
    // start idle
    cc25xx_strobe(RFST_SIDLE);

    //freq offset
    cc25xx_set_register(FSCTRL0, storage.frsky_freq_offset);

    //never automatically calibrate, po_timeout count = 64
    //no autotune as (we use our pll map)
    cc25xx_set_register(MCSM0,0x08);

    //set address
    cc25xx_set_register(ADDR, storage.frsky_txid[0]);

    //append status, filter by address, autoflush on bad crc, PQT=0
    cc25xx_set_register(PKTCTRL1, CC2500_PKTCTRL1_APPEND_STATUS | CC2500_PKTCTRL1_CRC_AUTOFLUSH | CC2500_PKTCTRL1_FLAG_ADR_CHECK_01);
}

void frsky_tune_channel(uint8_t ch)
{
    //start idle
    cc25xx_strobe(RFST_SIDLE);

    //set channel number
    cc25xx_set_register(CHANNR, ch);

    //start Self calib:
    cc25xx_strobe(RFST_SCAL);

    //wait for scal end
    //either delay_us(800) or check MARCSTATE:
    while(cc25xx_get_register(MARCSTATE) != 0x01);

    //now FSCAL3..1 shold be set up correctly! yay!
}

void frsky_handle_overflows(void)
{
    uint8_t marc_state;

    //fetch marc status
    marc_state = cc25xx_get_register(MARCSTATE) & 0x1F;
    if (marc_state == 0x11){
        debug("frsky: RXOVF\n");
        //flush rx buf
        cc25xx_strobe(RFST_SFRX);
        //cc25xx_strobe(RFST_SIDLE);
    }else if (marc_state == 0x16){
        debug("frsky: TXOVF\n");
        //flush tx buf
        cc25xx_strobe(RFST_SFTX);
        //cc25xx_strobe(RFST_SIDLE);
    }
}


void frsky_fetch_txid_and_hoptable(void){
    uint16_t hopdata_received = 0;
    uint8_t index;
    uint8_t i;

    //enter RX mode
    frsky_enter_rxmode(0);

#define MAX_BIND_PACKET_COUNT 10
    //DONE when n times a one:
#define HOPDATA_RECEIVE_DONE ((1<<(MAX_BIND_PACKET_COUNT))-1)

    //clear txid:
    storage.frsky_txid[0] = 0;
    storage.frsky_txid[1] = 0;

    //timeout to wait for packets
    timeout_set(9*3+1);

    //fetch hopdata array
    while(hopdata_received != HOPDATA_RECEIVE_DONE){
        //reset wdt
        wdt_reset();

        //handle any ovf conditions
        frsky_handle_overflows();

        //FIXME: this should be handled in a cleaner way.
        //as this is just for binding, stay with this fix for now...
        if (timeout_timed_out()){
            //do diversity
            cc25xx_switch_antenna();

            debug_putc('m');

            //next packet should be there ein 9ms
            //if no packet for 3*9ms -> reset rx chain:
            timeout_set(3*9+1);

            //re-prepare for next packet:
            cc25xx_strobe(RFST_SIDLE);
            //TESTME: moved to rx_sleep....
            //delay(1);
            frsky_packet_received = 0;
            cc25xx_rx_sleep();
            cc25xx_enable_receive();
            cc25xx_strobe(RFST_SRX);
        }

        //process incoming data
        cc25xx_process_packet(&frsky_packet_received, (volatile uint8_t *)&frsky_packet_buffer, FRSKY_PACKET_BUFFER_SIZE);

        if (frsky_packet_received){
            debug_putc('p');

            //prepare for next packet:
            frsky_packet_received = 0;
            cc25xx_enable_receive();
            cc25xx_strobe(RFST_SRX);


#if FRSKY_DEBUG_BIND_DATA
            if (FRSKY_VALID_FRAMELENGTH(frsky_packet_buffer)){
                debug("frsky: RX ");
                debug_flush();
                for(i=0; i<FRSKY_PACKET_BUFFER_SIZE; i++){
                    debug_put_hex8(frsky_packet_buffer[i]);
                    debug_putc(' ');
                }
                debug_put_newline();
            }
#endif


            //do we know our txid yet?
            if (FRSKY_VALID_PACKET_BIND(frsky_packet_buffer)){
                //next packet should be ther ein 9ms
                //if no packet for 3*9ms -> reset rx chain:
                timeout_set(3*9+1);

                debug_putc('B');
                if ((storage.frsky_txid[0] == 0) && (storage.frsky_txid[1] == 0)){
                    //no! extract this
                    storage.frsky_txid[0] = frsky_packet_buffer[3];
                    storage.frsky_txid[1] = frsky_packet_buffer[4];
                    //debug
                    debug("frsky: got txid 0x");
                    debug_put_hex8(storage.frsky_txid[0]);
                    debug_put_hex8(storage.frsky_txid[1]);
                    debug_put_newline();
                }

                //this is actually for us
                index = frsky_packet_buffer[5];

