betaflight/betaflight/src/main/rx/cc2500_frsky.c
                //valid bind index?
                if (index/5 < MAX_BIND_PACKET_COUNT){
                    //copy data to our hop list:
                    for(i=0; i<5; i++){
                        if ((index+i) < FRSKY_HOPTABLE_SIZE){
                            storage.frsky_hop_table[index+i] = frsky_packet_buffer[6+i];
                        }
                    }
                    //mark as done: set bit flag for index
                    hopdata_received |= (1<<(index/5));
                }else{
                    debug("frsky: invalid bind idx");
                    debug_put_uint8(index/5);
                    debug_put_newline();
                }

                //make sure we never read the same packet twice by crc flag
                frsky_packet_buffer[FRSKY_PACKET_BUFFER_SIZE-1] = 0x00;
            }
        }
    }

#if FRSKY_DEBUG_BIND_DATA
    debug("frsky: hop[] = ");
    for(i=0; i<FRSKY_HOPTABLE_SIZE; i++){
        debug_put_hex8(storage.frsky_hop_table[i]);
        debug_putc(' ');
        debug_flush();
    }
    debug_putc('\n');
#endif

    //idle
    cc25xx_strobe(RFST_SIDLE);
}
void frsky_calib_pll(void)
{
    uint8_t i;
    uint8_t ch;

    debug("frsky: calib pll\n");

    //fine tune offset
    cc25xx_set_register(FSCTRL0, storage.frsky_freq_offset);

    debug("frsky: tuning hop[] =");

    //calibrate pll for all channels
    for(i=0; i<FRSKY_HOPTABLE_SIZE; i++){
        //reset wdt
        wdt_reset();

        //fetch channel from hop_table:
        ch = storage.frsky_hop_table[i];

        //debug info
        debug_putc(' ');
        debug_put_hex8(ch);

        //set channel number
        frsky_tune_channel(ch);

        //store pll calibration:
        frsky_calib_fscal1_table[i] = cc25xx_get_register(FSCAL1);
    }
    debug_put_newline();

    //only needed once:
    frsky_calib_fscal3 = cc25xx_get_register(FSCAL3);
    frsky_calib_fscal2 = cc25xx_get_register(FSCAL2);

    //return to idle
    cc25xx_strobe(RFST_SIDLE);

    debug("frsky: calib fscal0 = ");
    debug_put_int8(storage.frsky_freq_offset);
    debug("\nfrsky: calib fscal1 = ");
    for(i=0; i<FRSKY_HOPTABLE_SIZE; i++){
        debug_put_hex8(frsky_calib_fscal1_table[i]);
        debug_putc(' ');
        debug_flush();
    }
    debug("\nfrsky: calib fscal2 = 0x");
    debug_put_hex8(frsky_calib_fscal2);
    debug("\nfrsky: calib fscal3 = 0x");
    debug_put_hex8(frsky_calib_fscal3);
    debug_put_newline();
    debug_flush();

    debug("frsky: calib pll done\n");
}


void frsky_set_channel(uint8_t hop_index){
    uint8_t ch = storage.frsky_hop_table[hop_index];
    //debug_putc('S'); debug_put_hex8(ch);

    //go to idle
    cc25xx_strobe(RFST_SIDLE);

    //fetch and set our stored pll calib data:
    cc25xx_set_register(FSCAL3, frsky_calib_fscal3);
    cc25xx_set_register(FSCAL2, frsky_calib_fscal2);
    cc25xx_set_register(FSCAL1, frsky_calib_fscal1_table[hop_index]);

    //set channel
    cc25xx_set_register(CHANNR, ch);
}



void frsky_increment_channel(int8_t cnt)
{
    int8_t next = frsky_current_ch_idx;
    //add increment
    next+=cnt;
    //convert to a safe unsigned number:
    if(next<0){
        next += FRSKY_HOPTABLE_SIZE;
    }
    if (next >= FRSKY_HOPTABLE_SIZE){
        next -= FRSKY_HOPTABLE_SIZE;
    }

    frsky_current_ch_idx = next;
    frsky_set_channel(frsky_current_ch_idx);
}


uint8_t frsky_extract_rssi(uint8_t rssi_raw)
{
#define FRSKY_RSSI_OFFSET 70
    if (rssi_raw >= 128){
        //adapted to fit better to the original values... FIXME: find real formula
        //return (rssi_raw * 18)/32 - 82;
        return ((((uint16_t)rssi_raw) * 18)>>5) - 82;
    }else{
        return ((((uint16_t)rssi_raw) * 18)>>5) + 65;
    }
}

void frsky_init(void)
{
    //uint8_t i;
    debug("frsky: init\n"); debug_flush();

    cc25xx_init();

    frsky_link_quality = 0;
    frsky_diversity_count = 0;
    frsky_packet_received = 0;
    frsky_packet_sent = 0;

    frsky_rssi = 100;

    // check if spi is working properly
    frsky_show_partinfo();

    // init frsky registersttings for cc2500
    frsky_configure();

    if (frsky_bind_jumper_set()){
        //do binding
        frsky_do_bind();
        //binding will never return/continue
    }

    //show info:
    debug("frsky: using txid 0x"); debug_flush();
    debug_put_hex8(storage.frsky_txid[0]);
    debug_put_hex8(storage.frsky_txid[1]);
    debug_put_newline();

    //init txid matching
    frsky_configure_address();

    //tune cc2500 pll and save the values to ram
    frsky_calib_pll();

    debug("frsky: init done\n");debug_flush();
}

static void frskySetup(void)
{
    storageInit();
    frsky_init();
}

void frskyInit(const rxConfig_t *rxConfig, rxRuntimeConfig_t *rxRuntimeConfig)
{
    UNUSED(rxConfig);
    rxRuntimeConfig->channelCount = FRSKY_CHANNEL_COUNT;
    frskySetup();
}
#endif

